Торговля_PostgreSQL.ПотоковоеСканирование/src/Catalogs/ПС_НастройкиРаспознавания/ПС_НастройкиРаспознавания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПС_НастройкиРаспознавания</name>
  <predefined>
    <items>
      <name>АдресСервисаРаспознаванияДокументов</name>
      <description>Адрес сервиса распознавания документов</description>
    </items>
    <items>
      <name>ЛогинN8N</name>
      <description>Логин сервиса</description>
    </items>
    <items>
      <name>ПарольN8N</name>
      <description>Пароль сервиса</description>
    </items>
    <items>
      <name>ОсновнаяЛицензия</name>
      <description>Основная лицензия</description>
    </items>
    <items>
      <name>РезервнаяЛицензия</name>
      <description>Резервная лицензия</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Торговля_PostgreSQL.ПотоковоеСканирование/src/Catalogs/ПС_НастройкиРаспознавания/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		
		Элементы.Наименование.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Если Объект.Ссылка = Справочники.ПС_НастройкиРаспознавания.ПарольN8N Тогда
		
		Элементы.Значение.Видимость = Ложь;
		Элементы.Пароль.Видимость = Истина;
		
	Иначе
		
		Элементы.Значение.Видимость = Истина;
		Элементы.Пароль.Видимость = Ложь;
				
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


//#Область ОбработчикиСобытийЭлементовШапкиФормы
//
//// Код процедур и функций
//
//#КонецОбласти
//
//#Область ОбработчикиКомандФормы
//
//// Код процедур и функций
//
//#КонецОбласти
//
//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти
